{"class_name": "Model", "keras_version": "1.2.2", "config": {"layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1, 128, 128], "input_dtype": "float32", "sparse": false, "name": "encode_input"}, "inbound_nodes": [], "name": "encode_input"}, {"class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "inbound_nodes": [], "config": {"batch_input_shape": [null, 1, 128, 128], "sparse": false, "input_dtype": "float32", "name": "encode_input"}, "name": "encode_input"}, {"class_name": "Convolution2D", "inbound_nodes": [[["encode_input", 0, 0]]], "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_1", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 4, "b_regularizer": null, "W_regularizer": null, "nb_row": 3, "activation": "linear", "border_mode": "same"}, "name": "convolution2d_1"}, {"class_name": "Activation", "inbound_nodes": [[["convolution2d_1", 0, 0]]], "config": {"activation": "relu", "trainable": true, "name": "activation_1"}, "name": "activation_1"}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["activation_1", 0, 0]]], "config": {"name": "maxpooling2d_1", "trainable": true, "dim_ordering": "th", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}, "name": "maxpooling2d_1"}, {"class_name": "Convolution2D", "inbound_nodes": [[["maxpooling2d_1", 0, 0]]], "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_2", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 8, "b_regularizer": null, "W_regularizer": null, "nb_row": 3, "activation": "linear", "border_mode": "same"}, "name": "convolution2d_2"}, {"class_name": "Activation", "inbound_nodes": [[["convolution2d_2", 0, 0]]], "config": {"activation": "relu", "trainable": true, "name": "activation_2"}, "name": "activation_2"}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["activation_2", 0, 0]]], "config": {"name": "maxpooling2d_2", "trainable": true, "dim_ordering": "th", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}, "name": "maxpooling2d_2"}, {"class_name": "Convolution2D", "inbound_nodes": [[["maxpooling2d_2", 0, 0]]], "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_3", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 16, "b_regularizer": null, "W_regularizer": null, "nb_row": 3, "activation": "linear", "border_mode": "same"}, "name": "convolution2d_3"}, {"class_name": "Activation", "inbound_nodes": [[["convolution2d_3", 0, 0]]], "config": {"activation": "relu", "trainable": true, "name": "activation_3"}, "name": "activation_3"}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["activation_3", 0, 0]]], "config": {"name": "maxpooling2d_3", "trainable": true, "dim_ordering": "th", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}, "name": "maxpooling2d_3"}, {"class_name": "Convolution2D", "inbound_nodes": [[["maxpooling2d_3", 0, 0]]], "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_4", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 16, "b_regularizer": null, "W_regularizer": null, "nb_row": 3, "activation": "linear", "border_mode": "same"}, "name": "convolution2d_4"}, {"class_name": "Activation", "inbound_nodes": [[["convolution2d_4", 0, 0]]], "config": {"activation": "relu", "trainable": true, "name": "activation_4"}, "name": "activation_4"}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["activation_4", 0, 0]]], "config": {"name": "maxpooling2d_4", "trainable": true, "dim_ordering": "th", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}, "name": "maxpooling2d_4"}, {"class_name": "Convolution2D", "inbound_nodes": [[["maxpooling2d_4", 0, 0]]], "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_5", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 32, "b_regularizer": null, "W_regularizer": null, "nb_row": 3, "activation": "linear", "border_mode": "same"}, "name": "convolution2d_5"}, {"class_name": "Activation", "inbound_nodes": [[["convolution2d_5", 0, 0]]], "config": {"activation": "relu", "trainable": true, "name": "activation_5"}, "name": "activation_5"}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["activation_5", 0, 0]]], "config": {"name": "maxpooling2d_5", "trainable": true, "dim_ordering": "th", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}, "name": "maxpooling2d_5"}, {"class_name": "Convolution2D", "inbound_nodes": [[["maxpooling2d_5", 0, 0]]], "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_6", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 32, "b_regularizer": null, "W_regularizer": null, "nb_row": 3, "activation": "linear", "border_mode": "same"}, "name": "convolution2d_6"}, {"class_name": "Activation", "inbound_nodes": [[["convolution2d_6", 0, 0]]], "config": {"activation": "relu", "trainable": true, "name": "activation_6"}, "name": "activation_6"}, {"class_name": "Flatten", "inbound_nodes": [[["activation_6", 0, 0]]], "config": {"trainable": true, "name": "flatten_1"}, "name": "flatten_1"}, {"class_name": "Dense", "inbound_nodes": [[["flatten_1", 0, 0]]], "config": {"W_constraint": null, "b_constraint": null, "name": "dense_1", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": 512, "b_regularizer": null, "W_regularizer": null, "activation": "relu", "output_dim": 128}, "name": "dense_1"}], "input_layers": [["encode_input", 0, 0]], "name": "model_1", "output_layers": [["dense_1", 0, 0]]}, "inbound_nodes": [[["encode_input", 0, 0]]], "name": "model_1"}, {"class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "inbound_nodes": [], "config": {"batch_input_shape": [null, 128], "sparse": false, "input_dtype": "float32", "name": "decode_input"}, "name": "decode_input"}, {"class_name": "Dense", "inbound_nodes": [[["decode_input", 0, 0]]], "config": {"W_constraint": null, "b_constraint": null, "name": "dense_2", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": 128, "b_regularizer": null, "W_regularizer": null, "activation": "relu", "output_dim": 512}, "name": "dense_2"}, {"class_name": "Reshape", "inbound_nodes": [[["dense_2", 0, 0]]], "config": {"target_shape": [32, 4, 4], "trainable": true, "name": "reshape_1"}, "name": "reshape_1"}, {"class_name": "UpSampling2D", "inbound_nodes": [[["reshape_1", 0, 0]]], "config": {"trainable": true, "name": "upsampling2d_1", "size": [2, 2]}, "name": "upsampling2d_1"}, {"class_name": "Convolution2D", "inbound_nodes": [[["upsampling2d_1", 0, 0]]], "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_7", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 32, "b_regularizer": null, "W_regularizer": null, "nb_row": 3, "activation": "linear", "border_mode": "same"}, "name": "convolution2d_7"}, {"class_name": "Activation", "inbound_nodes": [[["convolution2d_7", 0, 0]]], "config": {"activation": "relu", "trainable": true, "name": "activation_7"}, "name": "activation_7"}, {"class_name": "UpSampling2D", "inbound_nodes": [[["activation_7", 0, 0]]], "config": {"trainable": true, "name": "upsampling2d_2", "size": [2, 2]}, "name": "upsampling2d_2"}, {"class_name": "Convolution2D", "inbound_nodes": [[["upsampling2d_2", 0, 0]]], "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_8", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 16, "b_regularizer": null, "W_regularizer": null, "nb_row": 3, "activation": "linear", "border_mode": "same"}, "name": "convolution2d_8"}, {"class_name": "Activation", "inbound_nodes": [[["convolution2d_8", 0, 0]]], "config": {"activation": "relu", "trainable": true, "name": "activation_8"}, "name": "activation_8"}, {"class_name": "UpSampling2D", "inbound_nodes": [[["activation_8", 0, 0]]], "config": {"trainable": true, "name": "upsampling2d_3", "size": [2, 2]}, "name": "upsampling2d_3"}, {"class_name": "Convolution2D", "inbound_nodes": [[["upsampling2d_3", 0, 0]]], "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_9", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 16, "b_regularizer": null, "W_regularizer": null, "nb_row": 3, "activation": "linear", "border_mode": "same"}, "name": "convolution2d_9"}, {"class_name": "Activation", "inbound_nodes": [[["convolution2d_9", 0, 0]]], "config": {"activation": "relu", "trainable": true, "name": "activation_9"}, "name": "activation_9"}, {"class_name": "UpSampling2D", "inbound_nodes": [[["activation_9", 0, 0]]], "config": {"trainable": true, "name": "upsampling2d_4", "size": [2, 2]}, "name": "upsampling2d_4"}, {"class_name": "Convolution2D", "inbound_nodes": [[["upsampling2d_4", 0, 0]]], "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_10", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 8, "b_regularizer": null, "W_regularizer": null, "nb_row": 3, "activation": "linear", "border_mode": "same"}, "name": "convolution2d_10"}, {"class_name": "Activation", "inbound_nodes": [[["convolution2d_10", 0, 0]]], "config": {"activation": "relu", "trainable": true, "name": "activation_10"}, "name": "activation_10"}, {"class_name": "UpSampling2D", "inbound_nodes": [[["activation_10", 0, 0]]], "config": {"trainable": true, "name": "upsampling2d_5", "size": [2, 2]}, "name": "upsampling2d_5"}, {"class_name": "Convolution2D", "inbound_nodes": [[["upsampling2d_5", 0, 0]]], "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_11", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 4, "b_regularizer": null, "W_regularizer": null, "nb_row": 3, "activation": "linear", "border_mode": "same"}, "name": "convolution2d_11"}, {"class_name": "Activation", "inbound_nodes": [[["convolution2d_11", 0, 0]]], "config": {"activation": "relu", "trainable": true, "name": "activation_11"}, "name": "activation_11"}, {"class_name": "Convolution2D", "inbound_nodes": [[["activation_11", 0, 0]]], "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_12", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 1, "b_regularizer": null, "W_regularizer": null, "nb_row": 3, "activation": "linear", "border_mode": "same"}, "name": "convolution2d_12"}, {"class_name": "Activation", "inbound_nodes": [[["convolution2d_12", 0, 0]]], "config": {"activation": "relu", "trainable": true, "name": "activation_12"}, "name": "activation_12"}], "input_layers": [["decode_input", 0, 0]], "name": "model_2", "output_layers": [["activation_12", 0, 0]]}, "inbound_nodes": [[["model_1", 1, 0]]], "name": "model_2"}], "input_layers": [["encode_input", 0, 0]], "output_layers": [["model_2", 1, 0]], "name": "model_3"}}