{"class_name": "Model", "keras_version": "2.0.4", "config": {"layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 128, 128, 1], "name": "encode_input", "sparse": false}, "inbound_nodes": [], "name": "encode_input"}, {"class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "inbound_nodes": [], "config": {"dtype": "float32", "batch_input_shape": [null, 128, 128, 1], "name": "encode_input", "sparse": false}, "name": "encode_input"}, {"class_name": "Conv2D", "inbound_nodes": [[["encode_input", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_1", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 2, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "conv2d_1"}, {"class_name": "Activation", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "config": {"activation": "relu", "trainable": true, "name": "activation_1"}, "name": "activation_1"}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["activation_1", 0, 0, {}]]], "config": {"name": "max_pooling2d_1", "trainable": true, "data_format": "channels_last", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2]}, "name": "max_pooling2d_1"}, {"class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_2", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 4, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "conv2d_2"}, {"class_name": "Activation", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "config": {"activation": "relu", "trainable": true, "name": "activation_2"}, "name": "activation_2"}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["activation_2", 0, 0, {}]]], "config": {"name": "max_pooling2d_2", "trainable": true, "data_format": "channels_last", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2]}, "name": "max_pooling2d_2"}, {"class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_3", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 8, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "conv2d_3"}, {"class_name": "Activation", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "config": {"activation": "relu", "trainable": true, "name": "activation_3"}, "name": "activation_3"}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["activation_3", 0, 0, {}]]], "config": {"name": "max_pooling2d_3", "trainable": true, "data_format": "channels_last", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2]}, "name": "max_pooling2d_3"}, {"class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_3", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_4", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 8, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "conv2d_4"}, {"class_name": "Activation", "inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "config": {"activation": "relu", "trainable": true, "name": "activation_4"}, "name": "activation_4"}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["activation_4", 0, 0, {}]]], "config": {"name": "max_pooling2d_4", "trainable": true, "data_format": "channels_last", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2]}, "name": "max_pooling2d_4"}, {"class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_4", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_5", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 16, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "conv2d_5"}, {"class_name": "Activation", "inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "config": {"activation": "tanh", "trainable": true, "name": "activation_5"}, "name": "activation_5"}], "input_layers": [["encode_input", 0, 0]], "name": "model_1", "output_layers": [["activation_5", 0, 0]]}, "inbound_nodes": [[["encode_input", 0, 0, {}]]], "name": "model_1"}, {"class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "inbound_nodes": [], "config": {"dtype": "float32", "batch_input_shape": [null, 8, 8, 16], "name": "decode_input", "sparse": false}, "name": "decode_input"}, {"class_name": "GaussianNoise", "inbound_nodes": [[["decode_input", 0, 0, {}]]], "config": {"trainable": true, "name": "gaussian_noise_1", "stddev": 0.1}, "name": "gaussian_noise_1"}, {"class_name": "UpSampling2D", "inbound_nodes": [[["gaussian_noise_1", 0, 0, {}]]], "config": {"size": [2, 2], "trainable": true, "data_format": "channels_last", "name": "up_sampling2d_1"}, "name": "up_sampling2d_1"}, {"class_name": "Conv2D", "inbound_nodes": [[["up_sampling2d_1", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_6", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 8, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "conv2d_6"}, {"class_name": "Activation", "inbound_nodes": [[["conv2d_6", 0, 0, {}]]], "config": {"activation": "relu", "trainable": true, "name": "activation_6"}, "name": "activation_6"}, {"class_name": "UpSampling2D", "inbound_nodes": [[["activation_6", 0, 0, {}]]], "config": {"size": [2, 2], "trainable": true, "data_format": "channels_last", "name": "up_sampling2d_2"}, "name": "up_sampling2d_2"}, {"class_name": "Conv2D", "inbound_nodes": [[["up_sampling2d_2", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_7", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 8, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "conv2d_7"}, {"class_name": "Activation", "inbound_nodes": [[["conv2d_7", 0, 0, {}]]], "config": {"activation": "relu", "trainable": true, "name": "activation_7"}, "name": "activation_7"}, {"class_name": "UpSampling2D", "inbound_nodes": [[["activation_7", 0, 0, {}]]], "config": {"size": [2, 2], "trainable": true, "data_format": "channels_last", "name": "up_sampling2d_3"}, "name": "up_sampling2d_3"}, {"class_name": "Conv2D", "inbound_nodes": [[["up_sampling2d_3", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_8", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 4, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "conv2d_8"}, {"class_name": "Activation", "inbound_nodes": [[["conv2d_8", 0, 0, {}]]], "config": {"activation": "relu", "trainable": true, "name": "activation_8"}, "name": "activation_8"}, {"class_name": "UpSampling2D", "inbound_nodes": [[["activation_8", 0, 0, {}]]], "config": {"size": [2, 2], "trainable": true, "data_format": "channels_last", "name": "up_sampling2d_4"}, "name": "up_sampling2d_4"}, {"class_name": "Conv2D", "inbound_nodes": [[["up_sampling2d_4", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_9", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 2, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "conv2d_9"}, {"class_name": "Activation", "inbound_nodes": [[["conv2d_9", 0, 0, {}]]], "config": {"activation": "relu", "trainable": true, "name": "activation_9"}, "name": "activation_9"}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_9", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_10", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 1, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "conv2d_10"}, {"class_name": "Activation", "inbound_nodes": [[["conv2d_10", 0, 0, {}]]], "config": {"activation": "relu", "trainable": true, "name": "activation_10"}, "name": "activation_10"}], "input_layers": [["decode_input", 0, 0]], "name": "model_2", "output_layers": [["activation_10", 0, 0]]}, "inbound_nodes": [[["model_1", 1, 0, {}]]], "name": "model_2"}], "input_layers": [["encode_input", 0, 0]], "output_layers": [["model_2", 1, 0]], "name": "model_4"}, "backend": "tensorflow"}